tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::plans() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_plans")) return;
        bool success = false;
        if (actionIs("pause_indefinitely")) {
            success = g_app->pauseAutomaticWateringIndefinitely();
        } else if (actionIs("resume")) {
            success = g_app->resumeAutomaticWatering();
        } else if (actionIs("pause_until")) {
            char localDateTime[20]{};
            uint32_t resumeAt = 0;
            success = getParam("resume_at", localDateTime, sizeof(localDateTime)) &&
                      IrrigationTime::parseLocalDateTimeUtc8(localDateTime, resumeAt) &&
                      g_app->pauseAutomaticWateringUntil(resumeAt);
        } else {
            success = savePlanFromRequest();
        }
        redirectResult("/irrigation/plans", success);
        return;
    }
    if (!beginPage("浇水计划", "管理自动执行，并为首页手动浇水提供可编辑的时长模板")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".plan-toolbar{display:flex;align-items:center;justify-content:flex-end;margin:-4px 0 12px}"
        ".plan-auto{display:flex;align-items:center;justify-content:space-between;gap:16px;padding:14px;border:1px solid #cfe1e5;border-radius:10px;background:var(--eb-soft)}"
        ".plan-auto h3{margin:0 0 4px;font-size:17px}.plan-auto p{margin:0;color:var(--eb-muted)}.plan-auto-actions{display:flex;gap:8px;flex:0 0 auto}.plan-auto-actions form{margin:0}"
        ".plan-pause-modal{width:min(620px,calc(100vw - 28px))}.plan-pause-options{display:grid;gap:10px;margin-top:14px}.plan-pause-option{padding:14px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft)}.plan-pause-option h3{margin:0 0 3px;font-size:15px}.plan-pause-option>small{display:block;margin-bottom:12px;color:var(--eb-muted)}.plan-pause-fields{display:grid;gap:12px}.plan-pause-field{margin:0}.plan-pause-field input{width:100%;max-width:none;margin:5px 0 0}.plan-pause-shortcuts{display:flex;flex-wrap:wrap;gap:7px;margin-top:7px}.plan-pause-shortcuts button{min-height:32px;padding:5px 10px}.plan-pause-shortcuts button.selected{border-color:var(--eb-primary);background:var(--eb-primary-soft);color:var(--eb-primary)}.plan-pause-unavailable{margin:0;padding:9px 11px;border-radius:7px;background:var(--eb-warn-soft);color:var(--eb-warn);font-size:13px}.plan-pause-submit{display:flex;justify-content:flex-end;margin-top:12px}.plan-pause-indefinite{display:flex;align-items:center;justify-content:space-between;gap:14px}.plan-pause-indefinite h3{margin-bottom:3px}.plan-pause-indefinite p{margin:0}.plan-pause-indefinite form{margin:0;flex:0 0 auto}"
        ".plan-toolbar .btnlink{min-height:36px}"
        ".plan-list{display:grid;gap:12px}"
        ".plan-card{padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f6fbfc 0,#fff 58%)}"
        ".plan-card-head{display:flex;align-items:flex-start;justify-content:space-between;gap:16px}"
        ".plan-card-title{min-width:0}.plan-card-title-row{display:flex;align-items:center;flex-wrap:wrap;gap:8px}"
        ".plan-card-title h3{margin:0;font-size:18px;line-height:1.35;overflow-wrap:anywhere}"
        ".plan-card-title small{display:block;margin-top:3px;color:var(--eb-muted)}"
        ".plan-card-edit{flex:0 0 auto;min-width:68px}"
        ".plan-card-body{display:grid;grid-template-columns:minmax(170px,.65fr) minmax(0,2fr);gap:18px;margin-top:14px;padding-top:14px;border-top:1px solid var(--eb-line-soft)}"
        ".plan-summary-label{display:block;margin-bottom:7px;color:var(--eb-muted);font-size:12px;font-weight:650}"
        ".plan-time-list{display:flex;flex-wrap:wrap;gap:7px}"
        ".plan-time-chip{display:inline-flex;align-items:center;min-height:30px;padding:4px 10px;border:1px solid #cfe1e5;border-radius:999px;background:#fff;color:var(--eb-primary);font-weight:650;font-variant-numeric:tabular-nums}"
        ".plan-empty-value{color:var(--eb-muted)}"
        ".plan-zone-summary{display:grid;grid-template-columns:repeat(auto-fit,minmax(145px,1fr));gap:7px}"
        ".plan-zone-item{display:flex;align-items:baseline;justify-content:space-between;gap:10px;padding:8px 10px;border:1px solid var(--eb-line-soft);border-radius:7px;background:#fff}"
        ".plan-zone-item b{min-width:0;font-size:13px;font-weight:600;overflow-wrap:anywhere}.plan-zone-item span{flex:0 0 auto;color:var(--eb-primary);font-weight:650;white-space:nowrap}"
        ".plan-zone-item.zero span{color:var(--eb-muted);font-weight:500}"
        ".plan-modal{width:min(820px,calc(100vw - 28px))}"
        ".plan-editor{display:grid;gap:14px;margin-top:12px}"
        ".plan-group{padding:14px;border:1px solid var(--eb-line);border-radius:9px;background:var(--eb-soft)}"
        ".plan-group h3{margin:0 0 3px;font-size:15px}"
        ".plan-group>small{display:block;margin-bottom:12px;color:var(--eb-muted)}"
        ".plan-basic{display:grid;grid-template-columns:minmax(0,2fr) minmax(220px,1fr);gap:14px}"
        ".plan-basic .field,.plan-zone{margin:0}"
        ".plan-basic input[type=text]{margin-bottom:0}"
        ".plan-switch{padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}"
        ".plan-switch label{display:flex;align-items:center;gap:8px;margin:0}"
        ".plan-switch small{display:block;margin-top:5px;color:var(--eb-muted)}"
        ".plan-times,.plan-zones{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:10px}"
        ".plan-time,.plan-zone{padding:10px 12px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}"
        ".plan-time-row{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:8px;align-items:center}"
        ".plan-time input[type=time]{width:100%;min-width:0;min-height:34px;margin:0;padding:5px 8px}"
        ".plan-time .clear-time{min-width:56px}"
        ".plan-zone input{width:100%;max-width:none;margin:0}"
        ".plan-zone small{display:block;margin-top:5px;color:var(--eb-muted)}"
        ".plan-form-actions{padding-top:2px}"
        "@media(max-width:760px){"
        ".plan-auto{align-items:stretch;flex-direction:column}.plan-auto-actions,.plan-auto-actions form,.plan-auto-actions .btnlink{width:100%}.plan-pause-indefinite{align-items:stretch;flex-direction:column}.plan-pause-indefinite form,.plan-pause-indefinite input,.plan-pause-submit input{width:100%}"
        ".plan-toolbar{margin-top:0}.plan-toolbar .btnlink{width:100%}"
        ".plan-card{padding:13px}.plan-card-head{gap:10px}.plan-card-title h3{font-size:17px}.plan-card-edit{min-width:60px}"
        ".plan-card-body{grid-template-columns:1fr;gap:13px;margin-top:12px;padding-top:12px}"
        ".plan-zone-summary{grid-template-columns:repeat(2,minmax(0,1fr))}"
        ".plan-modal{width:calc(100vw - 20px)}"
        ".plan-basic,.plan-times,.plan-zones{grid-template-columns:1fr}"
        ".plan-group{padding:12px}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        const AutomaticWateringState automatic = g_app->automaticWateringState();
        const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
        const bool timeTrusted = now.synced &&
                                 g_app->schedulerTimeState() == WateringScheduler::TimeState::Ready;
        char automaticDetail[96]{};
        if (automatic.mode == AutomaticWateringMode::Enabled) {
            std::snprintf(automaticDetail, sizeof(automaticDetail), "已启用的计划会在设定时间自动执行。");
        } else if (automatic.mode == AutomaticWateringMode::PausedIndefinitely) {
            std::snprintf(automaticDetail, sizeof(automaticDetail), "已暂停，等待手动恢复；手动浇水不受影响。");
        } else if (!formatFullDateTime(automatic.resumeAtEpoch,
                                       automaticDetail,
                                       sizeof(automaticDetail))) {
            std::snprintf(automaticDetail, sizeof(automaticDetail), "已定时暂停，设备时间就绪后自动恢复。");
        }
        Esp32BaseWeb::beginPanel("自动浇水");
        Esp32BaseWeb::sendChunk("<div class='plan-auto'><div><h3><span class='tag ");
        Esp32BaseWeb::sendChunk(automatic.mode == AutomaticWateringMode::Enabled
                                    ? "ok'>正常运行"
                                    : "warn'>已暂停");
        Esp32BaseWeb::sendChunk("</span></h3><p>");
        if (automatic.mode == AutomaticWateringMode::PausedUntil && automaticDetail[0] != '\0') {
            Esp32BaseWeb::sendChunk("自动浇水将在 ");
        }
        Esp32BaseWeb::writeHtmlEscaped(automaticDetail);
        Esp32BaseWeb::sendChunk("</p></div><div class='plan-auto-actions'>");
        if (automatic.mode == AutomaticWateringMode::Enabled) {
            Esp32BaseWeb::sendChunk("<button type='button' class='btnlink info' onclick=\"document.getElementById('plan-pause').showModal()\">暂停自动浇水</button>");
        } else {
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans' onsubmit='return once(this)'><input type='hidden' name='action' value='resume'><input class='btnlink ok' type='submit' value='恢复自动浇水'></form>");
        }
        Esp32BaseWeb::sendChunk("</div></div>");
        Esp32BaseWeb::endPanel();
        if (automatic.mode == AutomaticWateringMode::Enabled) {
            const uint32_t initialResumeEpoch = timeTrusted && now.epochSec <= UINT32_MAX - 86400U
                                                    ? now.epochSec + 86400U
                                                    : 1767196800UL;
            char inputDateTime[20]{};
            char minimumDateTime[20]{};
            formatInputDateTime(initialResumeEpoch, inputDateTime, sizeof(inputDateTime));
            formatInputDateTime(timeTrusted && now.epochSec <= UINT32_MAX - 60U
                                    ? now.epochSec + 60U
                                    : 1767196800UL,
                                minimumDateTime,
                                sizeof(minimumDateTime));
            Esp32BaseWeb::sendChunk("<dialog id='plan-pause' class='panel eb-modal plan-pause-modal' data-eb-light-dismiss='1'><h2>暂停自动浇水</h2><p class='muted'>只影响之后的自动计划，不停止当前任务，也不影响首页的手动浇水。</p><div class='plan-pause-options'><form id='plan-pause-timed' class='plan-pause-option' method='post' action='/irrigation/plans' data-now-epoch='");
            sendUnsigned(now.epochSec);
            Esp32BaseWeb::sendChunk("' onsubmit='return submitTimedPause(this)'><input type='hidden' name='action' value='pause_until'><h3>暂停至恢复时间</h3><small>小时数和常用时间只用于快捷填写，最终以恢复时间为准。</small><div class='plan-pause-fields'><p class='field plan-pause-field'><label for='pause-hours'>暂停时长（小时）</label><input id='pause-hours' type='number' min='1' max='8760' step='1' value='24' inputmode='numeric'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk("><span class='plan-pause-shortcuts' aria-label='暂停时长快捷选择'><button type='button' class='secondary' data-pause-hours='12'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk(">12 小时</button><button type='button' class='secondary selected' data-pause-hours='24'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk(">24 小时</button><button type='button' class='secondary' data-pause-hours='48'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk(">48 小时</button></span></p><p class='field plan-pause-field'><label for='pause-resume-at'>恢复时间（UTC+8）</label><input id='pause-resume-at' type='datetime-local' name='resume_at' min='");
            Esp32BaseWeb::writeHtmlEscaped(minimumDateTime);
            Esp32BaseWeb::sendChunk("' max='2099-12-31T23:59' value='");
            Esp32BaseWeb::writeHtmlEscaped(inputDateTime);
            Esp32BaseWeb::sendChunk("' required");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk("><span class='plan-pause-shortcuts' aria-label='恢复时间快捷选择'><button type='button' class='secondary' data-pause-day='1'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk(">明天早上 6:00</button><button type='button' class='secondary' data-pause-day='2'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk(">后天早上 6:00</button></span></p>");
            if (!timeTrusted) Esp32BaseWeb::sendChunk("<p class='plan-pause-unavailable'>设备时间当前不可信，暂时不能设置自动恢复时间。</p>");
            Esp32BaseWeb::sendChunk("</div><div class='plan-pause-submit'><input type='submit' value='确认暂停'");
            if (!timeTrusted) Esp32BaseWeb::sendChunk(" disabled");
            Esp32BaseWeb::sendChunk("></div></form><div class='plan-pause-option plan-pause-indefinite'><div><h3>无限期暂停</h3><p class='muted'>不依赖设备时间，之后需要回到本页手动恢复。</p></div><form method='post' action='/irrigation/plans' onsubmit=\"return confirm('确认无限期暂停自动浇水？')&&once(this)\"><input type='hidden' name='action' value='pause_indefinitely'><input type='submit' value='无限期暂停'></form></div></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button></div></dialog>");
            Esp32BaseWeb::sendChunk(R"HTML(<script>(function(){
var form=document.getElementById('plan-pause-timed'),hours=document.getElementById('pause-hours'),resume=document.getElementById('pause-resume-at');if(!form||!hours||!resume)return;var base=Number(form.dataset.nowEpoch)||0,started=performance.now(),hourButtons=Array.prototype.slice.call(form.querySelectorAll('[data-pause-hours]')),dayButtons=Array.prototype.slice.call(form.querySelectorAll('[data-pause-day]'));
function nowEpoch(){return base+Math.floor((performance.now()-started)/1000)}function pad(v){return String(v).padStart(2,'0')}function formatUtc8(epoch){var d=new Date((epoch+28800)*1000);return d.getUTCFullYear()+'-'+pad(d.getUTCMonth()+1)+'-'+pad(d.getUTCDate())+'T'+pad(d.getUTCHours())+':'+pad(d.getUTCMinutes())}function selectHours(value){hourButtons.forEach(function(button){button.classList.toggle('selected',Number(button.dataset.pauseHours)===value)});dayButtons.forEach(function(button){button.classList.remove('selected')})}function clearHours(){hours.value='';hours.setCustomValidity('');hourButtons.forEach(function(button){button.classList.remove('selected')})}function updateFromHours(value){if(hours.value===''){hours.setCustomValidity('');hourButtons.forEach(function(button){button.classList.remove('selected')});return}if(!Number.isInteger(value)||value<1||value>8760){hours.setCustomValidity('请输入 1～8760 的整数小时。');hourButtons.forEach(function(button){button.classList.remove('selected')});return}hours.setCustomValidity('');resume.value=formatUtc8(nowEpoch()+value*3600);selectHours(value)}
hours.addEventListener('input',function(){updateFromHours(Number(hours.value))});hourButtons.forEach(function(button){button.addEventListener('click',function(){var value=Number(button.dataset.pauseHours);hours.value=value;updateFromHours(value)})});dayButtons.forEach(function(button){button.addEventListener('click',function(){var shifted=new Date((nowEpoch()+28800)*1000),day=Number(button.dataset.pauseDay),target=Date.UTC(shifted.getUTCFullYear(),shifted.getUTCMonth(),shifted.getUTCDate()+day,6,0,0)/1000-28800;clearHours();resume.value=formatUtc8(target);dayButtons.forEach(function(item){item.classList.toggle('selected',item===button)})})});resume.addEventListener('input',function(){clearHours();dayButtons.forEach(function(button){button.classList.remove('selected')})});window.submitTimedPause=function(target){if(!target.reportValidity())return false;return confirm('确认暂停自动浇水至 '+resume.value.replace('T',' ')+'（UTC+8）？')&&once(target)};
})();</script>)HTML");
