tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::zones() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_save")) return;
        redirectResult("/irrigation/zones", actionIs("save") && saveZoneFromRequest());
        return;
    }
    if (!beginPage("水路设置", "启用实际安装的水路，并设置名称和基准流量")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".zone-meter{display:flex;align-items:center;justify-content:space-between;gap:16px}"
        ".zone-meter-main{display:flex;align-items:baseline;flex-wrap:wrap;gap:8px}"
        ".zone-meter-label{margin:0;color:var(--eb-muted);font-size:13px}"
        ".zone-meter-value{display:flex;align-items:baseline;gap:6px;color:var(--eb-primary);line-height:1}"
        ".zone-meter-number{font-size:18px;font-weight:650}"
        ".zone-meter-unit{font-size:14px;color:var(--eb-muted)}"
        ".zone-table th{font-weight:600}.zone-table td{font-weight:400}"
        ".zone-table .tag{font-weight:500}"
        ".zone-table .btnlink{font-weight:500}"
        "@media(max-width:760px){"
        ".zone-meter{align-items:stretch;flex-direction:column;gap:10px}.zone-meter .btnlink{width:100%}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        char coefficient[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
        Esp32BaseWeb::beginPanel("水路列表");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part zone-table'><thead><tr><th>水路</th><th>名称</th><th>启用状态</th><th>基准流量</th><th>操作</th></tr></thead><tbody>");
        for (const ZoneConfig& zone : config->zones) {
            char value[20]{};
            if (zone.learnedFlowMlPerMinute != 0) {
                IrrigationConfigRules::formatLitersPerMinute(
                    zone.learnedFlowMlPerMinute, value, sizeof(value));
            }
            Esp32BaseWeb::sendChunk("<tr><td>水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</td><td>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("</td><td><span class='tag ");
            Esp32BaseWeb::sendChunk(zone.enabled ? "ok'>已启用" : "'>未启用");
            Esp32BaseWeb::sendChunk("</span></td><td>");
            if (zone.learnedFlowMlPerMinute == 0) Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span>");
            else { Esp32BaseWeb::writeHtmlEscaped(value); Esp32BaseWeb::sendChunk(" L/min"); }
            Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("').showModal()\">修改</button>");
            if (zone.enabled) { Esp32BaseWeb::sendChunk("<a class='btnlink ok compact' href='/irrigation/zones/learning?zone="); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>学习基准流量</a>"); }
            Esp32BaseWeb::sendChunk("</div></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::beginPanel("流量计维护");
        Esp32BaseWeb::sendChunk("<div class='zone-meter'><div class='zone-meter-main'><p class='zone-meter-label'>稳态流量系数</p><div class='zone-meter-value'><span class='zone-meter-number'>");
        Esp32BaseWeb::writeHtmlEscaped(coefficient);
        Esp32BaseWeb::sendChunk("</span><span class='zone-meter-unit'>P/L</span></div></div><a class='btnlink ok compact' href='/irrigation/zones/flow-calibration'>流量计校准</a></div>");
        Esp32BaseWeb::endPanel();
        for (const ZoneConfig& zone : config->zones) {
            char learnedFlow[20]{};
            IrrigationConfigRules::formatLitersPerMinute(
                zone.learnedFlowMlPerMinute, learnedFlow, sizeof(learnedFlow));
            Esp32BaseWeb::sendChunk("<dialog id='zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal' data-eb-light-dismiss='1'><h2>修改水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</h2><form method='post' action='/irrigation/zones' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision);
            Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>水路名称</label><input name='name' maxlength='63' required value='"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("'><small>用于计划、运行和记录页面显示。</small></p><p class='field full'><label>基准流量</label><input type='number' name='learned_flow' min='0' max='100' step='0.001' required value='");
            Esp32BaseWeb::writeHtmlEscaped(learnedFlow);
            Esp32BaseWeb::sendChunk("'><small>单位：L/min，范围 0～100.000；0 表示未设置。</small></p><p class='field full'><label><input type='checkbox' name='enabled' value='1' "); if (zone.enabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 启用这条水路</label><small>未安装的水路保持关闭，正常使用页面不会显示。</small></p></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存'></div></form>");
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    endPage();
}

void IrrigationWeb::flowCalibration() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_flow_calibration")) return;
        bool success = false;
        const WateringStatus status = g_app->wateringStatus();
        if (actionIs("start")) {
            uint32_t zoneId = 0;
            success = uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId) &&
                      g_app->startFlowCalibration(static_cast<uint8_t>(zoneId), 10) ==
                          WateringStartResult::Started;
        } else if (actionIs("stop")) {
            success = status.active && status.purpose == WateringPurpose::FlowCalibration &&
                      g_app->stopWatering();
        } else if (actionIs("measurement")) {
            uint32_t measuredMl = 0;
            success = uintParam("measured_ml",
                                FlowCalibrationService::kMinimumMeasuredWaterMl,
                                FlowCalibrationService::kMaximumMeasuredWaterMl,
                                measuredMl) &&
                      g_app->submitFlowCalibrationMeasurement(measuredMl);
        } else if (actionIs("invalid")) {
            success = g_app->markFlowCalibrationSampleInvalid();
        } else if (actionIs("update")) {
            uint32_t sampleNumber = 0;
            uint32_t measuredMl = 0;
            success = uintParam("sample", 1, FlowCalibrationService::kMaximumSamples,
                                sampleNumber) &&
                      uintParam("measured_ml",
                                FlowCalibrationService::kMinimumMeasuredWaterMl,
                                FlowCalibrationService::kMaximumMeasuredWaterMl,
                                measuredMl) &&
                      g_app->updateFlowCalibrationMeasurement(
                          static_cast<uint8_t>(sampleNumber - 1U), measuredMl);
        } else if (actionIs("delete")) {
            uint32_t sampleNumber = 0;
            success = uintParam("sample", 1, FlowCalibrationService::kMaximumSamples,
                                sampleNumber) &&
                      g_app->deleteFlowCalibrationSample(
                          static_cast<uint8_t>(sampleNumber - 1U));
        } else if (actionIs("apply")) {
            success = g_app->applyFlowCalibrationResult();
        } else if (actionIs("clear")) {
            g_app->resetFlowCalibration();
            success = !g_app->wateringStatus().active;
        }
        redirectResult("/irrigation/zones/flow-calibration", success);
        return;
    }
    if (!beginPage("流量计校准", "识别稳定出水阶段，用多组实测总水量计算稳态流量系数")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".cal-current{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:18px;align-items:center;padding:18px;border:1px solid #cfe1e5;border-radius:12px;background:linear-gradient(135deg,#edf8f9,#fff 72%)}"
        ".cal-current-label{margin:0 0 5px;color:var(--eb-muted);font-size:13px}"
        ".cal-current-value{display:flex;align-items:baseline;gap:7px;color:var(--eb-primary);line-height:1}"
        ".cal-current-number{font-size:32px;font-weight:500;letter-spacing:-.02em}"
        ".cal-current-unit{font-size:14px;color:var(--eb-muted)}"
        ".cal-current-note{max-width:360px;color:var(--eb-muted);font-size:13px;line-height:1.6}"
        ".cal-steps{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:10px;margin-bottom:14px}"
        ".cal-step{display:grid;grid-template-columns:28px minmax(0,1fr);gap:9px;align-items:start;padding:12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft);font-size:13px;line-height:1.55}"
        ".cal-step-num{display:flex;align-items:center;justify-content:center;width:26px;height:26px;border-radius:50%;background:var(--eb-primary-soft);color:var(--eb-primary);font-weight:600}"
        ".cal-action{padding:13px 14px;border:1px solid var(--eb-line-soft);border-radius:10px;background:#fff}"
        ".cal-start-form{display:grid;grid-template-columns:minmax(360px,1fr) minmax(280px,.8fr);gap:16px;align-items:stretch}.cal-start-picker label{display:block;margin-bottom:6px;font-weight:500}.cal-start-controls{display:flex;align-items:flex-start;gap:10px}.cal-start-controls select{flex:1;min-width:220px}.cal-start-controls .actions{flex:0 0 auto;margin:0}.cal-start-info{display:flex;flex-direction:column;justify-content:center;padding-left:16px;border-left:1px solid var(--eb-line-soft);color:var(--eb-muted);font-size:12px;line-height:1.55}.cal-start-info b{color:var(--eb-text);font-size:13px;font-weight:400}"
        ".cal-live-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:14px}.cal-live-head h3{margin:0 0 3px;font-size:17px}.cal-live-head p{margin:0;color:var(--eb-muted);font-size:13px}"
        ".cal-live .metrics{grid-template-columns:repeat(4,minmax(0,1fr))}.cal-live .metric b{font-weight:500}.cal-live .metric small{display:block;margin-top:4px;color:var(--eb-muted);font-size:11px;font-weight:400;line-height:1.4}.cal-live .actions{margin-top:12px}.cal-live-note{display:flex;flex-wrap:wrap;gap:8px 18px;margin-top:10px;padding:10px 12px;border-radius:8px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px;line-height:1.5}.cal-live-note b{color:var(--eb-text);font-weight:400}"
        ".cal-pending{display:grid;grid-template-columns:minmax(0,1.25fr) minmax(280px,.75fr);gap:18px;align-items:start}.cal-pending-summary{padding:14px;border-radius:9px;background:var(--eb-soft)}.cal-pending-summary h3{margin:0 0 4px;font-size:16px;font-weight:500}.cal-pending-route{margin:0 0 12px;color:var(--eb-muted);font-size:12px}.cal-phase-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:8px}.cal-phase{padding:9px 10px;border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff}.cal-phase-label{display:block;color:var(--eb-muted);font-size:11px}.cal-phase-value{display:block;margin-top:4px;color:var(--eb-text);font-size:13px;font-weight:400;line-height:1.45}.cal-phase-note{display:block;margin-top:3px;color:var(--eb-muted);font-size:11px;line-height:1.4}.cal-pending-total{margin:10px 0 0;color:var(--eb-muted);font-size:12px}.cal-pending label{font-weight:500}"
        ".cal-sample-toolbar{display:flex;align-items:center;justify-content:space-between;gap:12px;margin-bottom:10px}.cal-counts{display:flex;flex-wrap:wrap;gap:7px}.cal-count{padding:5px 9px;border-radius:999px;background:var(--eb-soft);color:var(--eb-muted);font-size:12px}.cal-count b{color:var(--eb-text);font-weight:500}.cal-count.ok{background:var(--eb-ok-soft);color:var(--eb-ok)}.cal-count.bad{background:var(--eb-danger-soft);color:var(--eb-danger)}"
        ".cal-sample-list{display:grid;gap:10px}.cal-sample{padding:13px 14px;border:1px solid var(--eb-line-soft);border-radius:10px;background:#fff}.cal-sample-head{display:flex;align-items:flex-start;justify-content:space-between;gap:12px;margin-bottom:10px}.cal-sample-title{display:flex;align-items:center;gap:8px;min-width:0}.cal-sample-name{font-size:14px;font-weight:500}.cal-sample-route{color:var(--eb-muted);font-size:12px}.cal-sample-head-actions{display:flex;align-items:center;gap:7px}.cal-sample-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:8px}.cal-sample-fact{min-width:0;padding:9px 10px;border-radius:8px;background:var(--eb-soft)}.cal-sample-fact.wide{grid-column:span 2}.cal-sample-label{display:block;color:var(--eb-muted);font-size:11px}.cal-sample-value{display:block;margin-top:4px;color:var(--eb-text);font-size:13px;font-weight:400;line-height:1.45;overflow-wrap:anywhere}.cal-sample-note{display:block;margin-top:3px;color:var(--eb-muted);font-size:11px;font-weight:400;line-height:1.45;overflow-wrap:anywhere}.cal-residual{font-variant-numeric:tabular-nums}.cal-sample-actions{display:flex;align-items:center;gap:6px;white-space:nowrap}.cal-sample-actions form{margin:0}.cal-sample-actions button,.cal-sample-actions input{min-height:30px;padding:5px 10px;font-size:12px}.cal-status{display:inline-flex;align-items:center;padding:3px 8px;border-radius:999px;font-size:12px;font-weight:400}.cal-status.ok{background:var(--eb-ok-soft);color:var(--eb-ok)}.cal-status.bad{background:var(--eb-danger-soft);color:var(--eb-danger)}"
        ".cal-empty{padding:20px;text-align:center;border:1px dashed #c9d6dc;border-radius:9px;background:var(--eb-soft)}"
        ".cal-empty-title{margin:0;color:#344054;font-size:15px;font-weight:500}"
        ".cal-empty-text{margin:5px 0 0;color:var(--eb-muted);font-size:13px}"
        ".cal-result{display:grid;grid-template-columns:minmax(270px,.72fr) minmax(460px,1.28fr);gap:20px;padding:16px;border:1px solid #bfe0d4;border-radius:11px;background:linear-gradient(135deg,var(--eb-ok-soft),#fff)}"
        ".cal-result-label{margin:0 0 5px;color:var(--eb-ok);font-size:13px}"
        ".cal-result-primary{display:flex;flex-direction:column;align-items:flex-start}.cal-result-value{font-size:32px;font-weight:500;color:var(--eb-ok);line-height:1.15}.cal-result-state{margin-top:10px}.cal-result-primary .actions{margin:14px 0 0}.cal-result-meta{margin-top:auto;padding-top:11px}.cal-result-time{display:block;color:var(--eb-muted);font-size:12px;line-height:1.55}"
        ".cal-result-detail{min-width:0}.cal-formula{margin:0 0 10px;padding:10px 12px;border-radius:8px;background:rgba(255,255,255,.76);color:#344054;font-size:13px;line-height:1.55;overflow-wrap:anywhere}.cal-result-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:8px}.cal-result-fact{padding:9px 10px;border:1px solid rgba(191,224,212,.75);border-radius:8px;background:rgba(255,255,255,.58)}.cal-result-fact span{display:block;color:var(--eb-muted);font-size:11px}.cal-result-fact b{display:block;margin-top:3px;color:var(--eb-text);font-size:14px;font-weight:400}.cal-result-note{margin:9px 0 0;color:var(--eb-muted);font-size:12px;line-height:1.55}"
        ".cal-sample-toolbar form{margin:0}.cal-sample-toolbar input{min-height:30px;padding:5px 10px;font-size:12px}"
        ".cal-edit{width:min(460px,calc(100vw - 28px))}.cal-edit h2{margin-bottom:4px}.cal-edit>p{margin-top:0}"
        "@media(max-width:1100px){.cal-sample-grid{grid-template-columns:repeat(2,minmax(0,1fr))}}"
        "@media(max-width:900px){.cal-start-form,.cal-result{grid-template-columns:1fr}.cal-start-controls select{width:100%;min-width:0}.cal-start-info{padding:10px 0 0;border-left:0;border-top:1px solid var(--eb-line-soft)}.cal-result-meta{margin-top:8px}.cal-phase-grid{grid-template-columns:1fr}}"
        "@media(max-width:760px){"
        ".cal-current,.cal-steps{grid-template-columns:1fr}"
        ".cal-current{padding:14px}.cal-current-number{font-size:28px}.cal-live .metrics{grid-template-columns:repeat(2,minmax(0,1fr))}.cal-pending{grid-template-columns:1fr}.cal-result-grid{grid-template-columns:repeat(2,minmax(0,1fr))}.cal-sample-toolbar{align-items:flex-start}.cal-start-controls{align-items:stretch}"
        "}"
        "@media(max-width:560px){.cal-sample-grid{grid-template-columns:1fr}.cal-sample-fact.wide{grid-column:auto}.cal-sample-head{align-items:flex-start}.cal-sample-head-actions{flex-wrap:wrap;justify-content:flex-end}}"
        "@media(max-width:480px){.cal-result-grid{grid-template-columns:1fr}}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (!config) { endPage(); return; }
    const WateringStatus status = g_app->wateringStatus();
    const FlowCalibrationService& calibration = g_app->flowCalibration();
    const bool active = status.active && status.purpose == WateringPurpose::FlowCalibration;
    const bool managementLocked = status.active || calibration.hasPendingMeasurement();
    char coefficient[20]{};
    IrrigationConfigRules::formatPulsesPerLiter(
        config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
    Esp32BaseWeb::beginPanel("当前稳态流量系数");
    Esp32BaseWeb::sendChunk("<div class='cal-current'><div><p class='cal-current-label'>设备当前使用</p><div class='cal-current-value'><span class='cal-current-number'>");
    Esp32BaseWeb::writeHtmlEscaped(coefficient);
    Esp32BaseWeb::sendChunk("</span><span class='cal-current-unit'>P/L</span></div></div><div class='cal-current-note'>稳定出水状态下每升水对应的脉冲数。校准完成前不会修改；确认使用结果后才保存。</div></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::beginPanel("开始校准");
    Esp32BaseWeb::sendChunk("<div class='cal-steps'><div class='cal-step'><span class='cal-step-num'>1</span><span>从完全停止状态开始接水，系统自动识别进入稳态的时刻。</span></div><div class='cal-step'><span class='cal-step-num'>2</span><span>停止后填写实测总水量；至少两个不同水量，建议三个样本。</span></div><div class='cal-step'><span class='cal-step-num'>3</span><span>仅用稳态阶段脉冲拟合，确认使用后才写入设备参数。</span></div></div><div class='cal-action'>");
    if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务", "请等待当前任务结束后再校准。");
    } else if (active) {
        const uint8_t zoneId = status.activeZoneId;
        const ZoneWateringSummary& liveZone = status.zones[status.currentStepIndex];
        const char* zoneName = zoneId >= 1 && zoneId <= config->zones.size()
                                   ? config->zones[zoneId - 1U].name.data()
                                   : "当前水路";
        char liveRate[24]{};
        formatSignedHundredths(liveZone.calibrationLatestPulseRateX100,
                               liveRate,
                               sizeof(liveRate));
        char liveStartupRate[24]{}, liveSteadyRate[24]{};
        formatPulseRate(liveZone.calibrationStartupPulses,
                        liveZone.calibrationSteadyStartedMs,
                        liveStartupRate,
                        sizeof(liveStartupRate));
        formatPulseRate(liveZone.calibrationSteadyPulses,
                        liveZone.calibrationSteadyDurationMs,
                        liveSteadyRate,
                        sizeof(liveSteadyRate));
        Esp32BaseWeb::sendChunk("<div id='cal-live' class='cal-live'><div class='cal-live-head'><div><h3>"); Esp32BaseWeb::writeHtmlEscaped(zoneName); Esp32BaseWeb::sendChunk("</h3><p id='cal-state'>"); Esp32BaseWeb::writeHtmlEscaped(wateringStateName(status.state)); Esp32BaseWeb::sendChunk("</p></div><span class='tag warn'>正在采样</span></div><div class='metrics'><div class='metric'><b id='cal-elapsed'>"); sendDuration(status.elapsedSec); Esp32BaseWeb::sendChunk("</b><span>已运行</span></div><div class='metric'><b id='cal-pulses'>"); sendUnsigned(status.pulseCount); Esp32BaseWeb::sendChunk("</b><span>完整脉冲</span></div><div class='metric'><b id='cal-steady-state'>");
        if (liveZone.calibrationSteadyDetected) {
            Esp32BaseWeb::sendChunk("已确认");
        } else if (!status.flowEstablished) {
            Esp32BaseWeb::sendChunk("等待水流");
        } else if (liveZone.calibrationCollectedWindows >=
                   liveZone.calibrationRequiredWindows) {
            Esp32BaseWeb::sendChunk("波动偏大");
        } else {
            Esp32BaseWeb::sendChunk("已采集 ");
            sendUnsigned(liveZone.calibrationCollectedWindows);
            Esp32BaseWeb::sendChunk(" / ");
            sendUnsigned(liveZone.calibrationRequiredWindows);
            Esp32BaseWeb::sendChunk(" 个窗口");
        }
        Esp32BaseWeb::sendChunk("</b><span>稳态确认进度</span><small id='cal-steady-help'>"); if (liveZone.calibrationSteadyDetected) Esp32BaseWeb::sendChunk("后续波动仍会继续监测"); else if (!status.flowEstablished) Esp32BaseWeb::sendChunk("检测到脉冲后开始统计"); else if (liveZone.calibrationCollectedWindows >= liveZone.calibrationRequiredWindows) { Esp32BaseWeb::sendChunk("最近 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个窗口尚未满足波动要求，继续识别"); } else { Esp32BaseWeb::sendChunk("收满 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个窗口后比较速率波动"); } Esp32BaseWeb::sendChunk("</small></div><div class='metric'><b id='cal-remaining'>"); sendDuration(status.currentZoneRemainingSec); Esp32BaseWeb::sendChunk("</b><span>剩余上限</span></div></div><div class='cal-live-note'><span>检测规则：<b>每个窗口 "); sendUnsigned(liveZone.calibrationWindowSec); Esp32BaseWeb::sendChunk(" 秒，需连续 "); sendUnsigned(liveZone.calibrationRequiredWindows); Esp32BaseWeb::sendChunk(" 个，窗口速率波动不超过 "); sendUnsigned(liveZone.calibrationAllowedVariationPercent); Esp32BaseWeb::sendChunk("%</b></span><span>启动阶段：<b id='cal-startup-phase'>"); if (liveZone.calibrationSteadyDetected) { sendMilliseconds(liveZone.calibrationSteadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(liveZone.calibrationStartupPulses); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(liveStartupRate); Esp32BaseWeb::sendChunk(" P/s"); } else Esp32BaseWeb::sendChunk("等待稳态确认"); Esp32BaseWeb::sendChunk("</b></span><span>稳态阶段：<b id='cal-steady-phase'>"); if (liveZone.calibrationSteadyDetected) { sendMilliseconds(liveZone.calibrationSteadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(liveZone.calibrationSteadyPulses); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(liveSteadyRate); Esp32BaseWeb::sendChunk(" P/s"); } else Esp32BaseWeb::sendChunk("尚未开始"); Esp32BaseWeb::sendChunk("</b></span><span>最近窗口：<b id='cal-rate'>"); Esp32BaseWeb::writeHtmlEscaped(liveRate); Esp32BaseWeb::sendChunk(" P/s</b></span></div><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='stop'><div class='actions'><input class='danger' type='submit' value='停止本次采样'></div></form></div>");
    } else if (calibration.hasPendingMeasurement()) {
        const uint8_t pendingZoneId = calibration.pendingZoneId();
        const char* pendingZoneName = pendingZoneId >= 1 && pendingZoneId <= config->zones.size()
                                          ? config->zones[pendingZoneId - 1U].name.data()
                                          : "未知水路";
        const FlowCalibrationService::Sample* pending = calibration.pendingSample();
        char pendingStartupRate[24]{}, pendingSteadyRate[24]{}, pendingStopRate[24]{};
        formatPulseRate(pending->startupPulseCount, pending->steadyStartedMs,
                        pendingStartupRate, sizeof(pendingStartupRate));
        formatPulseRate(pending->steadyPulseCount, pending->steadyDurationMs,
                        pendingSteadyRate, sizeof(pendingSteadyRate));
        formatPulseRate(pending->stopPulseCount, pending->stopDurationMs,
