tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
                        pendingStopRate, sizeof(pendingStopRate));
        Esp32BaseWeb::sendChunk("<div class='cal-pending'><div class='cal-pending-summary'><h3>本次采样已停止</h3><p class='cal-pending-route'>采样水路："); Esp32BaseWeb::writeHtmlEscaped(pendingZoneName); Esp32BaseWeb::sendChunk("</p><div class='cal-phase-grid'><div class='cal-phase'><span class='cal-phase-label'>启动阶段</span><span class='cal-phase-value'>"); sendMilliseconds(pending->steadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(pending->startupPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(pendingStartupRate); Esp32BaseWeb::sendChunk(" P/s</span><span class='cal-phase-note'>从开阀到进入稳态</span></div><div class='cal-phase'><span class='cal-phase-label'>稳态阶段</span><span class='cal-phase-value'>"); sendMilliseconds(pending->steadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(pending->steadyPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(pendingSteadyRate); Esp32BaseWeb::sendChunk(" P/s</span><span class='cal-phase-note'>从进入稳态到停止命令</span></div><div class='cal-phase'><span class='cal-phase-label'>停止阶段</span><span class='cal-phase-value'>"); sendMilliseconds(pending->stopDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(pending->stopPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(pendingStopRate); Esp32BaseWeb::sendChunk(" P/s</span><span class='cal-phase-note'>从停止命令到输出关闭</span></div></div><p class='cal-pending-total'>完整采样："); sendDuration(calibration.pendingElapsedSec()); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(calibration.pendingPulseCount()); Esp32BaseWeb::sendChunk(" 脉冲</p></div><div><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='measurement'><div class='fieldgrid'><p class='field full'><label>本次实测总水量</label><input type='number' name='measured_ml' min='1000' max='1000000' step='1' inputmode='numeric' required autofocus><small>填写三个阶段实际接到的全部水量，单位 mL。</small></p></div><div class='actions'><input type='submit' value='保存有效样本'></div></form><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return confirm(&quot;确认本次接水无效？该样本会保留，但不参与计算。&quot;)&&once(this)'><input type='hidden' name='action' value='invalid'><div class='actions'><input class='secondary' type='submit' value='本次接水无效'></div></form></div></div>");
    } else if (calibration.sampleCount() < FlowCalibrationService::kMaximumSamples) {
        bool hasEligibleZone = false;
        for (const ZoneConfig& zone : config->zones) {
            hasEligibleZone = hasEligibleZone || zone.enabled;
        }
        if (hasEligibleZone) {
            Esp32BaseWeb::sendChunk("<form class='cal-start-form' method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认开始新样本？所选水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><div class='cal-start-picker'><label>校准水路</label><div class='cal-start-controls'><select name='zone_id'>");
            for (const ZoneConfig& zone : config->zones) if (zone.enabled) { Esp32BaseWeb::sendChunk("<option value='"); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data()); Esp32BaseWeb::sendChunk("</option>"); }
            Esp32BaseWeb::sendChunk("</select><div class='actions'><input type='submit' value='开始新样本'></div></div></div><div class='cal-start-info'><b>已保存 "); sendUnsigned(calibration.sampleCount()); Esp32BaseWeb::sendChunk(" / 10 个样本，还可增加 "); sendUnsigned(FlowCalibrationService::kMaximumSamples - calibration.sampleCount()); Esp32BaseWeb::sendChunk(" 个</b><span>每个样本可重新选择水路。稳态判定：每个窗口 "); sendUnsigned(config->calibrationStability.windowSec); Esp32BaseWeb::sendChunk(" 秒，需连续 "); sendUnsigned(config->calibrationStability.requiredWindows); Esp32BaseWeb::sendChunk(" 个，窗口速率波动不超过 "); sendUnsigned(config->calibrationStability.allowedVariationPercent); Esp32BaseWeb::sendChunk("%。</span></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                     "没有可用于校准的水路",
                                     "请先启用至少一条水路。");
        }
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "已达到 10 个样本", "请删除不需要的样本，或全部清空后重新开始。");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("校准样本");
    Esp32BaseWeb::sendChunk("<div class='cal-sample-toolbar'><div class='cal-counts'><span class='cal-count'><b>"); sendUnsigned(calibration.sampleCount()); Esp32BaseWeb::sendChunk("/10</b> 全部样本</span><span class='cal-count ok'><b>"); sendUnsigned(calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 有效</span><span class='cal-count bad'><b>"); sendUnsigned(calibration.sampleCount() - calibration.validSampleCount()); Esp32BaseWeb::sendChunk("</b> 无效</span></div>");
    if (calibration.sampleCount() != 0 && !managementLocked) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认清空全部校准样本？设备当前使用的流量系数不会改变。')&&once(this)\"><input type='hidden' name='action' value='clear'><input class='danger' type='submit' value='全部清空'></form>");
    Esp32BaseWeb::sendChunk("</div>");
    if (calibration.sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<div class='cal-empty'><p class='cal-empty-title'>尚无校准样本</p><p class='cal-empty-text'>完成第一次采样后，有效和无效样本都会显示在这里。</p></div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='cal-sample-list'>");
        for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
            const FlowCalibrationService::Sample* sample = calibration.sample(index);
            const char* sampleZoneName = sample->zoneId >= 1 && sample->zoneId <= config->zones.size()
                                             ? config->zones[sample->zoneId - 1U].name.data()
                                             : "未知水路";
            char startupRate[24]{}, steadyRate[24]{}, stopRate[24]{};
            formatPulseRate(sample->startupPulseCount, sample->steadyStartedMs,
                            startupRate, sizeof(startupRate));
            formatPulseRate(sample->steadyPulseCount, sample->steadyDurationMs,
                            steadyRate, sizeof(steadyRate));
            formatPulseRate(sample->stopPulseCount, sample->stopDurationMs,
                            stopRate, sizeof(stopRate));
            Esp32BaseWeb::sendChunk("<article class='cal-sample'><div class='cal-sample-head'><div class='cal-sample-title'><span class='cal-sample-name'>样本 "); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("</span><span class='cal-sample-route'>"); Esp32BaseWeb::writeHtmlEscaped(sampleZoneName); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-head-actions'><span class='cal-status "); Esp32BaseWeb::sendChunk(sample->valid ? "ok'>有效" : "bad'>无效"); Esp32BaseWeb::sendChunk("</span><div class='cal-sample-actions'>");
            if (managementLocked) {
                Esp32BaseWeb::sendChunk("</div>");
            } else {
                if (sample->valid) { Esp32BaseWeb::sendChunk("<button class='secondary' type='button' onclick=\"document.getElementById('cal-edit-"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("').showModal()\">修改</button>"); }
                Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认删除这个样本？删除后无法恢复。')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='sample' value='"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("'><input class='danger' type='submit' value='删除'></form></div>");
            }
            Esp32BaseWeb::sendChunk("</div></div><div class='cal-sample-grid'><div class='cal-sample-fact'><span class='cal-sample-label'>实测总水量</span><span class='cal-sample-value'>");
            if (sample->valid) { sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk(" mL"); } else Esp32BaseWeb::sendChunk("—");
            Esp32BaseWeb::sendChunk("</span><span class='cal-sample-note'>三个阶段实际接到的总水量</span></div><div class='cal-sample-fact'><span class='cal-sample-label'>启动阶段</span><span class='cal-sample-value'>");
            if (sample->steadyDetected) { sendMilliseconds(sample->steadyStartedMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->startupPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(startupRate); Esp32BaseWeb::sendChunk(" P/s"); } else Esp32BaseWeb::sendChunk("未识别稳态");
            Esp32BaseWeb::sendChunk("</span><span class='cal-sample-note'>开阀至进入稳态；首次出水 "); sendMilliseconds(sample->flowEstablishedMs); if (!sample->steadyDetected) { Esp32BaseWeb::sendChunk("，完整采样 "); sendUnsigned(sample->pulseCount); Esp32BaseWeb::sendChunk(" 脉冲"); } Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-fact'><span class='cal-sample-label'>稳态阶段</span><span class='cal-sample-value'>");
            if (sample->steadyDetected) { sendMilliseconds(sample->steadyDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->steadyPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(steadyRate); Esp32BaseWeb::sendChunk(" P/s"); } else Esp32BaseWeb::sendChunk("—");
            Esp32BaseWeb::sendChunk("</span><span class='cal-sample-note'>"); if (sample->steadyDetected) { char detectedRate[24]{}, latestRate[24]{}; formatSignedHundredths(sample->pulseRateX100, detectedRate, sizeof(detectedRate)); formatSignedHundredths(sample->latestPulseRateX100, latestRate, sizeof(latestRate)); Esp32BaseWeb::sendChunk("识别时 "); Esp32BaseWeb::writeHtmlEscaped(detectedRate); Esp32BaseWeb::sendChunk(" P/s，最近窗口 "); Esp32BaseWeb::writeHtmlEscaped(latestRate); Esp32BaseWeb::sendChunk(" P/s；判定规则：每个窗口 "); sendUnsigned(sample->stabilityWindowSec); Esp32BaseWeb::sendChunk(" 秒，连续 "); sendUnsigned(sample->requiredStableWindows); Esp32BaseWeb::sendChunk(" 个，波动不超过 "); sendUnsigned(sample->allowedVariationPercent); Esp32BaseWeb::sendChunk("%"); if (sample->steadyLaterUnstable) Esp32BaseWeb::sendChunk("；后续有波动"); } else Esp32BaseWeb::sendChunk("不参与计算"); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-fact'><span class='cal-sample-label'>停止阶段</span><span class='cal-sample-value'>"); sendMilliseconds(sample->stopDurationMs); Esp32BaseWeb::sendChunk(" · "); sendUnsigned(sample->stopPulseCount); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(stopRate); Esp32BaseWeb::sendChunk(" P/s</span><span class='cal-sample-note'>完整运行 "); sendDuration(sample->elapsedSec); Esp32BaseWeb::sendChunk("；"); Esp32BaseWeb::writeHtmlEscaped(sample->stopReason == WateringStopReason::Completed ? "达到 10 分钟上限" : stopReasonName(sample->stopReason)); Esp32BaseWeb::sendChunk("</span></div><div class='cal-sample-fact wide cal-residual'><span class='cal-sample-label'>拟合诊断</span>");
            if (!sample->valid) {
                Esp32BaseWeb::sendChunk("<span class='cal-sample-value'>不参与计算</span><span class='cal-sample-note'>无效样本只保留采样记录</span>");
            } else if (!calibration.resultReady()) {
                Esp32BaseWeb::sendChunk("<span class='cal-sample-value'>等待有效结果</span><span class='cal-sample-note'>至少需要两个不同水量的有效样本</span>");
            } else {
                char predicted[32]{}, residualPulse[32]{}, residualPercent[32]{};
                formatSignedHundredths(sample->predictedPulseX100,
                                       predicted,
                                       sizeof(predicted));
                formatSignedHundredths(sample->residualPulseX100,
                                       residualPulse,
                                       sizeof(residualPulse),
                                       true);
                formatSignedHundredths(sample->residualPercentX100,
                                       residualPercent,
                                       sizeof(residualPercent),
                                       true);
                char steadyWater[32]{}, nonSteadyWater[32]{};
                formatSignedHundredths(sample->estimatedSteadyWaterMlX100,
                                       steadyWater,
                                       sizeof(steadyWater));
                formatSignedHundredths(sample->estimatedNonSteadyWaterMlX100,
                                       nonSteadyWater,
                                       sizeof(nonSteadyWater),
                                       true);
                Esp32BaseWeb::sendChunk("<span class='cal-sample-value'>偏差 "); Esp32BaseWeb::writeHtmlEscaped(residualPulse); Esp32BaseWeb::sendChunk(" 脉冲 · "); Esp32BaseWeb::writeHtmlEscaped(residualPercent); Esp32BaseWeb::sendChunk("%</span><span class='cal-sample-note'>估算稳态水量 "); Esp32BaseWeb::writeHtmlEscaped(steadyWater); Esp32BaseWeb::sendChunk(" mL，启停非稳态水量 "); Esp32BaseWeb::writeHtmlEscaped(nonSteadyWater); Esp32BaseWeb::sendChunk(" mL；模型预测稳态脉冲 "); Esp32BaseWeb::writeHtmlEscaped(predicted); Esp32BaseWeb::sendChunk("</span>");
            }
            Esp32BaseWeb::sendChunk("</div></div></article>");
        }
        Esp32BaseWeb::sendChunk("</div>");
    }
    Esp32BaseWeb::endPanel();

