tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel("计算结果");
    if (!calibration.resultReady()) {
        if (calibration.validSampleCount() < 2) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "还不能计算结果", "至少需要两个不同水量的有效样本；无效样本不会参与计算。");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "当前样本无法形成有效结果", "请检查水量是否存在差异、脉冲是否随水量增加，或删除有问题的样本后重试。");
        }
    } else {
        char result[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            calibration.combinedPulsesPerLiterX100(), result, sizeof(result));
        const bool matchesCurrent = config->flowMeter.pulsesPerLiterX100 ==
                                    calibration.combinedPulsesPerLiterX100();
        const bool appliedInSession = calibration.appliedCoefficientX100() ==
                                      calibration.combinedPulsesPerLiterX100() &&
                                      calibration.appliedEpoch() != 0;
        char nonSteadyWater[32]{}, maximumResidual[32]{};
        formatSignedHundredths(calibration.combinedNonSteadyWaterMlX100(),
                               nonSteadyWater,
                               sizeof(nonSteadyWater),
                               true);
        formatSignedHundredths(calibration.maximumResidualPercentX100(),
                               maximumResidual,
                               sizeof(maximumResidual));
        Esp32BaseWeb::sendChunk("<div class='cal-result'><div class='cal-result-primary'><p class='cal-result-label'>稳态流量系数</p><div class='cal-result-value'>"); Esp32BaseWeb::writeHtmlEscaped(result); Esp32BaseWeb::sendChunk(" <span class='cal-current-unit'>P/L</span></div><span class='cal-result-state tag "); Esp32BaseWeb::sendChunk(matchesCurrent ? "ok'>设备正在使用此数值" : "warn'>新结果尚未应用"); Esp32BaseWeb::sendChunk("</span>");
        if (!matchesCurrent && !managementLocked) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认使用当前样本计算得到的稳态流量系数？')&&once(this)\"><input type='hidden' name='action' value='apply'><div class='actions'><input type='submit' value='使用此结果'></div></form>");
        Esp32BaseWeb::sendChunk("<div class='cal-result-meta'><span class='cal-result-time'>结果更新：");
        char timeText[32]{};
        if (calibration.resultUpdatedEpoch() != 0 && Esp32BaseTime::formatEpoch(calibration.resultUpdatedEpoch(), timeText, sizeof(timeText), "%Y-%m-%d %H:%M:%S")) Esp32BaseWeb::writeHtmlEscaped(timeText); else Esp32BaseWeb::sendChunk("设备时间不可用");
        Esp32BaseWeb::sendChunk("</span>");
        if (calibration.appliedEpoch() != 0) { Esp32BaseWeb::sendChunk(appliedInSession ? "<span class='cal-result-time'>应用于设备：" : "<span class='cal-result-time'>上次应用："); if (Esp32BaseTime::formatEpoch(calibration.appliedEpoch(), timeText, sizeof(timeText), "%Y-%m-%d %H:%M:%S")) Esp32BaseWeb::writeHtmlEscaped(timeText); else Esp32BaseWeb::sendChunk("设备时间不可用"); Esp32BaseWeb::sendChunk("</span>"); }
        if (!matchesCurrent) { Esp32BaseWeb::sendChunk("<span class='cal-result-time'>设备当前仍使用 "); Esp32BaseWeb::writeHtmlEscaped(coefficient); Esp32BaseWeb::sendChunk(" P/L</span>"); }
        Esp32BaseWeb::sendChunk("</div></div><div class='cal-result-detail'><p class='cal-formula'>实测总水量 = 稳态水量估算 + 启停非稳态水量估算；稳态系数只使用各样本的稳态阶段脉冲拟合。</p><div class='cal-result-grid'><div class='cal-result-fact'><span>启停非稳态水量估算</span><b>"); Esp32BaseWeb::writeHtmlEscaped(nonSteadyWater); Esp32BaseWeb::sendChunk(" mL</b></div><div class='cal-result-fact'><span>拟合数据</span><b>稳态阶段脉冲</b></div><div class='cal-result-fact'><span>有效样本</span><b>"); sendUnsigned(calibration.validSampleCount()); Esp32BaseWeb::sendChunk(" 个</b></div><div class='cal-result-fact'><span>涉及水路</span><b>"); sendUnsigned(calibration.validZoneCount()); Esp32BaseWeb::sendChunk(" 条</b></div><div class='cal-result-fact'><span>水量跨度</span><b>"); sendUnsigned(calibration.volumeSpanMl()); Esp32BaseWeb::sendChunk(" mL</b></div><div class='cal-result-fact'><span>最大拟合残差</span><b>");
        if (calibration.validSampleCount() == 2) Esp32BaseWeb::sendChunk("暂无法检验"); else { Esp32BaseWeb::writeHtmlEscaped(maximumResidual); Esp32BaseWeb::sendChunk("%"); }
        Esp32BaseWeb::sendChunk("</b></div></div><p class='cal-result-note'>非稳态水量是由多组样本共同估算的启动与停止阶段合计值；当前数据不能可靠拆分成单独的启动水量和停止水量。</p></div></div>");
        const uint8_t flags = calibration.qualityFlags();
        if (calibration.volumeSpanMl() >= 1000U) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "水量跨度达到 1 L", "这组样本对量杯读数误差更不敏感。");
        if (flags & FlowCalibrationService::kQualityOnlyTwoSamples) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "当前只有两个有效样本", "两点必然完全落在拟合直线上，暂时无法检验一致性；结果可以使用，建议增加第三个样本。");
        if (flags & FlowCalibrationService::kQualitySmallVolumeSpan) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水量差小于 500 mL", "量杯误差容易被放大，建议增加差距更大的样本。");
        if (flags & FlowCalibrationService::kQualityNonMonotonic) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "样本趋势不完全一致", "建议检查接水读数，或删除有问题的样本。");
        if (flags & FlowCalibrationService::kQualityResidualHigh) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "拟合残差较大", "建议检查或补充样本后再应用。");
        if (flags & FlowCalibrationService::kQualityPostSteadyUnstable) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分样本进入稳态后仍有波动", "结果仍可使用，请结合样本中的稳态速率和拟合偏差判断。");
        if (flags & FlowCalibrationService::kQualityNegativeNonSteadyWater) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "非稳态水量估算为负值", "当前样本与阶段模型不完全一致；结果仍可使用，建议检查接水读数或补充样本。");
        if (calibration.validZoneCount() > 1) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "样本来自不同水路", "不同水路的启停特性可能不同，请结合每条样本的拟合偏差判断；系统不会限制应用。");
    }
    Esp32BaseWeb::endPanel();

    for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
        const FlowCalibrationService::Sample* sample = calibration.sample(index);
        if (!sample || !sample->valid || managementLocked) continue;
        Esp32BaseWeb::sendChunk("<dialog id='cal-edit-"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("' class='panel eb-modal cal-edit' data-eb-light-dismiss='1'><h2>修改样本 "); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("</h2><p class='muted'>只能修正实测总水量；设备记录的脉冲、时间和停止原因不会改变。</p><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='update'><input type='hidden' name='sample' value='"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>实测总水量</label><input type='number' name='measured_ml' min='1000' max='1000000' step='1' inputmode='numeric' required value='"); sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk("'><small>单位 mL，保存后结果会自动重新计算。</small></p></div><div class='actions'><button class='secondary' type='button' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存修改'></div></form></dialog>");
    }
    if (active) Esp32BaseWeb::sendChunk("<script>(function(){function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}function duration(v){v=Math.max(0,Number(v)||0);if(v<60)return v+' 秒';return Math.floor(v/60)+' 分 '+(v%60)+' 秒'}function millis(v){v=Math.max(0,Number(v)||0);return (v/1000).toFixed(1)+' 秒'}function rate(p,m){m=Number(m)||0;return m>0?(Number(p||0)*1000/m).toFixed(2):'—'}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||s.purpose!==1){location.reload();return}var states=['空闲','区域启动中','等待水流','正在采样','正在停止'];set('cal-state',states[s.state]||'状态未知');set('cal-elapsed',duration(s.elapsedSec));set('cal-remaining',duration(s.currentZoneRemainingSec));set('cal-pulses',s.pulseCount);var z=s.zones&&s.zones[s.currentStepIndex];if(z){var detected=!!z.calibrationSteadyDetected,flow=!!s.flowEstablished,full=Number(z.calibrationCollectedWindows||0)>=Number(z.calibrationRequiredWindows||0);set('cal-steady-state',detected?'已确认':(!flow?'等待水流':(full?'波动偏大':'已采集 '+z.calibrationCollectedWindows+' / '+z.calibrationRequiredWindows+' 个窗口')));set('cal-steady-help',detected?'后续波动仍会继续监测':(!flow?'检测到脉冲后开始统计':(full?'最近 '+z.calibrationRequiredWindows+' 个窗口尚未满足波动要求，继续识别':'收满 '+z.calibrationRequiredWindows+' 个窗口后比较速率波动')));set('cal-startup-phase',detected?millis(z.calibrationSteadyStartedMs)+' · '+z.calibrationStartupPulses+' 脉冲 · '+rate(z.calibrationStartupPulses,z.calibrationSteadyStartedMs)+' P/s':'等待稳态确认');set('cal-steady-phase',detected?millis(z.calibrationSteadyDurationMs)+' · '+z.calibrationSteadyPulses+' 脉冲 · '+rate(z.calibrationSteadyPulses,z.calibrationSteadyDurationMs)+' P/s':'尚未开始');set('cal-rate',(Number(z.calibrationLatestPulseRateX100||0)/100).toFixed(2)+' P/s')}setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}setTimeout(poll,1000)})();</script>");
    endPage();
}

void IrrigationWeb::zoneLearning() {
    uint32_t zoneId = 0;
    char zoneText[12]{};
    if (getParam("zone", zoneText, sizeof(zoneText))) parseUint(zoneText, 1, BoardPins::kZoneCount, zoneId);
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_learning")) return;
        if (!uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId)) {
            Esp32BaseWeb::sendText(400, "invalid_zone"); return;
        }
        const WateringStatus status = g_app->wateringStatus();
        bool success = false;
        if (actionIs("start")) success = g_app->startZoneFlowLearning(static_cast<uint8_t>(zoneId)) == WateringStartResult::Started;
        else if (actionIs("stop")) success = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId && g_app->stopWatering();
        else if (actionIs("save")) { uint32_t revision = 0; success = uintParam("revision", 1, UINT32_MAX, revision) && g_app->pendingLearnedZoneId() == zoneId && g_app->saveLearnedZoneFlow(revision); }
        else if (actionIs("discard")) { success = g_app->pendingLearnedZoneId() == zoneId; if (success) g_app->discardLearnedZoneFlow(); }
        char location[96]{};
        std::snprintf(location, sizeof(location), "/irrigation/zones/learning?zone=%lu&result=%s", static_cast<unsigned long>(zoneId), success ? "ok" : "error");
        Esp32BaseWeb::redirectSeeOther(location);
        return;
    }
    if (!beginPage("基准流量学习", "等待流量稳定后生成该水路的基准流量")) return;
    const IrrigationConfig* config = g_app->configuration();
    if (!config || zoneId == 0) { Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "水路参数无效"); endPage(); return; }
    const ZoneConfig& zone = config->zones[zoneId - 1U];
    const WateringStatus status = g_app->wateringStatus();
    const bool active = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId;
    char learned[20]{};
    IrrigationConfigRules::formatLitersPerMinute(zone.learnedFlowMlPerMinute, learned, sizeof(learned));
    char learnedWithUnit[32]{};
    std::snprintf(learnedWithUnit, sizeof(learnedWithUnit), "%s L/min", learned);
    Esp32BaseWeb::beginPanel("学习水路");
    Esp32BaseWeb::sendInfoRowCompact("水路名称", "", zone.name.data());
    Esp32BaseWeb::sendInfoRowCompact("当前基准流量", zone.learnedFlowMlPerMinute == 0 ? "尚未设置" : "", zone.learnedFlowMlPerMinute == 0 ? "未设置" : learnedWithUnit);
    Esp32BaseWeb::sendInfoRowCompact("安全上限", "达到上限仍不稳定时自动停止", "10 分钟");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::beginPanel("学习状态");
    if (!zone.enabled) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "这条水路尚未启用", "请先返回水路设置启用。");
    } else if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务");
    } else if (active) {
        Esp32BaseWeb::sendChunk("<div class='metrics'><div class='metric'><b id='learn-elapsed'>"); sendUnsigned(status.elapsedSec); Esp32BaseWeb::sendChunk(" s</b><span>已运行</span></div><div class='metric'><b id='learn-current'>"); sendUnsigned(status.currentFlowMlPerMinute); Esp32BaseWeb::sendChunk(" mL/min</b><span>最近 5 秒流量</span></div><div class='metric'><b id='learn-average'>"); sendUnsigned(status.learningAverageMlPerMinute); Esp32BaseWeb::sendChunk(" mL/min</b><span>窗口平均值</span></div><div class='metric'><b id='learn-range'>"); sendUnsigned(status.learningMinimumMlPerMinute); Esp32BaseWeb::sendChunk("–"); sendUnsigned(status.learningMaximumMlPerMinute); Esp32BaseWeb::sendChunk("</b><span>窗口范围</span></div></div><p class='muted'>有效窗口：<b id='learn-count'>"); sendUnsigned(status.learningSampleCount); Esp32BaseWeb::sendChunk("/5</b></p><form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='stop'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='停止学习'></div></form>");
    } else if (g_app->pendingLearnedZoneId() == zoneId) {
        char suggestion[20]{};
        const bool validSuggestion = IrrigationConfigRules::formatLitersPerMinute(
            g_app->pendingLearnedFlowMlPerMinute(), suggestion, sizeof(suggestion));
        if (validSuggestion) {
            char suggestionWithUnit[32]{};
            std::snprintf(suggestionWithUnit, sizeof(suggestionWithUnit), "%s L/min", suggestion);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "学习完成", suggestionWithUnit);
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision); Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='保存为基准流量'></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                     "学习结果超出有效范围",
                                     "基准流量必须在 0～100.000 L/min，请检查稳态流量系数后重新学习。");
        }
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='discard'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='放弃结果'></div></form>");
    } else if (g_app->pendingLearnedZoneId() != 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                 "另一条水路有待确认的学习结果",
                                 "请先返回对应水路保存或放弃该结果。");
    } else {
        if (status.purpose == WateringPurpose::ZoneFlowLearning && status.lastZoneId == zoneId && status.lastStopReason == WateringStopReason::LearningTimeout) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "学习超时", "10 分钟内没有取得稳定流量，请检查供水和管路。");
        Esp32BaseWeb::sendChunk("<p class='muted'>系统每 5 秒计算一次流量，最近 5 个窗口波动不超过平均值的 10%时自动完成。</p><form method='post' action='/irrigation/zones/learning' onsubmit=\"return confirm('确认开始学习基准流量？开始后这条水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='开始学习'></div></form>");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendChunk("<p><a class='btnlink secondary' href='/irrigation/zones'>返回水路设置</a></p>");
    if (active) Esp32BaseWeb::sendChunk("<script>(function(){function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||s.purpose!==2){location.reload();return;}set('learn-elapsed',s.elapsedSec+' s');set('learn-current',s.currentFlowMlPerMinute+' mL/min');set('learn-average',s.learningAverageMlPerMinute+' mL/min');set('learn-range',s.learningMinimumMlPerMinute+'–'+s.learningMaximumMlPerMinute);set('learn-count',s.learningSampleCount+'/5');setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}setTimeout(poll,1000)})();</script>");
    endPage();
}

